In [15]:
import pandas as pd
import numpy as np

In [9]:
s = pd.Series(range(100,110),dtype=float)

In [7]:
s.dtype

dtype('int64')

In [10]:
s = pd.Series({"apple":"A sweet red","mango":"king of friuts"})

In [11]:
s

apple       A sweet red
mango    king of friuts
dtype: object

In [13]:
pd.Series(["king of fruits","A sweet red"],index=["Mango","Apple"])

Mango    king of fruits
Apple       A sweet red
dtype: object

In [19]:
pd.DataFrame(data=np.random.randint(10,20,(5,5)),index=np.random.randint(50,100,(5,)),columns=np.random.randint(30,60,(5,)))

    56  36  41  56  42
64  16  10  16  19  11
65  11  12  11  13  11
75  11  18  16  13  10
82  19  16  15  17  18
79  15  16  19  13  10

In [20]:
pd.DataFrame(data=np.random.randint(10,20,(5,5)),index=['A','B','C','D','E'],columns=np.random.randint(30,60,(5,)))

   36  56  59  36  57
A  17  11  18  14  17
B  15  10  14  14  19
C  15  10  12  13  15
D  17  14  10  17  10
E  10  19  19  16  10

In [21]:
pd.DataFrame(data=np.random.randint(10,20,(5,5)),index=['A','B','C','D','E'],columns=['V','W','X','Y','Z'])

    V   W   X   Y   Z
A  19  15  13  16  18
B  15  19  18  19  17
C  13  16  13  16  15
D  12  11  12  14  11
E  17  19  13  12  12

In [22]:
n = data=np.random.randint(10,20,(5,5))
ind=np.random.randint(50,100,(5,))
cols = np.random.randint(50,100,(5,))

In [23]:
n

array([[18, 15, 17, 18, 17],
       [16, 16, 10, 17, 16],
       [14, 11, 10, 18, 10],
       [15, 13, 15, 19, 10],
       [16, 19, 19, 15, 12]])

In [24]:
ind

array([82, 88, 75, 85, 96])

In [25]:
cols

array([69, 91, 54, 56, 78])

In [26]:
names = ["Azhad","Naman","Mohit"]
ages = [20,19,29]

In [27]:
d = {"names":names,"ages":ages}

In [28]:
d

{'names': ['Azhad', 'Naman', 'Mohit'], 'ages': [20, 19, 29]}

In [29]:
pd.DataFrame(d)

   names  ages
0  Azhad    20
1  Naman    19
2  Mohit    29

In [44]:
li = [{"names":"Anuj","age":62},{"names":"Mohit","age":69}]

In [45]:
df = pd.DataFrame(li)

In [37]:
li2 = [{"Names":"Anuj","Age":62},{"names":"Mohit","age":69}]

In [38]:
pd.DataFrame(li2)

  Names   Age  names   age
0  Anuj  62.0    NaN   NaN
1   NaN   NaN  Mohit  69.0

In [46]:
df.to_csv("hello.csv",index=False)

In [49]:
df.to_csv("hello1.csv",sep=';',line_terminator='\n\n',index=True)

In [52]:
df.to_csv("hello1.csv",line_terminator='-',index=True)

In [53]:
df = pd.read_csv("hello.csv")

In [54]:
df.to_excel("hello.xlsx")

In [55]:
df.to_html("hello.html")

In [57]:
series1 = df.names

In [58]:
series1

0      Anuj
1     Mohit
2    Ankush
Name: names, dtype: object

In [59]:
series2 = df['age']

In [60]:
series2

0    62
1    69
2    90
Name: age, dtype: int64

In [61]:
df.age

0    62
1    69
2    90
Name: age, dtype: int64

In [65]:
df["names"]

0      Anuj
1     Mohit
2    Ankush
Name: names, dtype: object

In [66]:
df["places"] = ["Delhi"]*3

In [67]:
df

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [68]:
["Delhi"]*3

['Delhi', 'Delhi', 'Delhi']

In [69]:
df

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [71]:
newdf = df[["names","age"]]

In [72]:
newdf

    names  age
0    Anuj   62
1   Mohit   69
2  Ankush   90

In [76]:
df[df['age'] >26]

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [77]:
df[df.age >26]

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [78]:
df.age > 26

0    True
1    True
2    True
Name: age, dtype: bool

In [79]:
df[df['age'] >26]

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [80]:
df.loc[df.age > 26]

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [82]:
df.iloc[2:] #it is use for index

    names  age places
2  Ankush   90  Delhi

In [83]:
df

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [85]:
df.iloc[:2,1:] #slicing of data

   age places
0   62  Delhi
1   69  Delhi

In [87]:
df.iloc[::-1,1:]

   age places
2   90  Delhi
1   69  Delhi
0   62  Delhi

In [88]:
df

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
names     3 non-null object
age       3 non-null int64
places    3 non-null object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [90]:
stats = df.describe()

             age
count   3.000000
mean   73.666667
std    14.571662
min    62.000000
25%    65.500000
50%    69.000000
75%    79.500000
max    90.000000

In [91]:
type(df.describe())

pandas.core.frame.DataFrame

In [92]:
df.sort_index(ascending=False)

    names  age places
2  Ankush   90  Delhi
1   Mohit   69  Delhi
0    Anuj   62  Delhi

In [93]:
df.sort_index()

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [94]:
df.sort_index(axis=1,ascending=False)

  places   names  age
0  Delhi    Anuj   62
1  Delhi   Mohit   69
2  Delhi  Ankush   90

In [95]:
df.sort_index(axis=1,ascending=True)

   age   names places
0   62    Anuj  Delhi
1   69   Mohit  Delhi
2   90  Ankush  Delhi

In [96]:
df.sort_values("age")

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [100]:
df.sort_values("age",axis=0,ascending=False)

    names  age places
2  Ankush   90  Delhi
1   Mohit   69  Delhi
0    Anuj   62  Delhi

In [104]:
df.sort_values("names")

    names  age places
2  Ankush   90  Delhi
0    Anuj   62  Delhi
1   Mohit   69  Delhi

In [105]:
df.sort_values("names",axis=0)

    names  age places
2  Ankush   90  Delhi
0    Anuj   62  Delhi
1   Mohit   69  Delhi

In [107]:
df.sort_values()

    names  age places
2  Ankush   90  Delhi
0    Anuj   62  Delhi
1   Mohit   69  Delhi

In [109]:
data = pd.DataFrame(n)

In [110]:
data

    0   1   2   3   4
0  18  15  17  18  17
1  16  16  10  17  16
2  14  11  10  18  10
3  15  13  15  19  10
4  16  19  19  15  12

In [112]:
data.sort_values(2,axis=1) #we are sorting column2 with axis =1 columnwis

    2   4   1   0   3
0  17  17  15  18  18
1  10  16  16  16  17
2  10  10  11  14  18
3  15  10  13  15  19
4  19  12  19  16  15

In [113]:
data[5] = 1

In [114]:
data

    0   1   2   3   4  5
0  18  15  17  18  17  1
1  16  16  10  17  16  1
2  14  11  10  18  10  1
3  15  13  15  19  10  1
4  16  19  19  15  12  1

In [116]:
data.head(2)

    0   1   2   3   4  5
0  18  15  17  18  17  1
1  16  16  10  17  16  1

In [117]:
data.tail()

    0   1   2   3   4  5
0  18  15  17  18  17  1
1  16  16  10  17  16  1
2  14  11  10  18  10  1
3  15  13  15  19  10  1
4  16  19  19  15  12  1

In [118]:
data.tail(2)

    0   1   2   3   4  5
3  15  13  15  19  10  1
4  16  19  19  15  12  1

In [119]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [120]:
df

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [121]:
df.columns

Index(['names', 'age', 'places'], dtype='object')

In [123]:
b = df.sort_values("age")

In [125]:
b.columns

Index(['names', 'age', 'places'], dtype='object')

In [126]:
b.values

array([['Anuj', 62, 'Delhi'],
       ['Mohit', 69, 'Delhi'],
       ['Ankush', 90, 'Delhi']], dtype=object)

In [128]:
(data.values)

array([[18, 15, 17, 18, 17,  1],
       [16, 16, 10, 17, 16,  1],
       [14, 11, 10, 18, 10,  1],
       [15, 13, 15, 19, 10,  1],
       [16, 19, 19, 15, 12,  1]])

In [130]:
(data.values).dtype

dtype('int64')

In [131]:
df

    names  age places
0    Anuj   62  Delhi
1   Mohit   69  Delhi
2  Ankush   90  Delhi

In [132]:
df.T

            0      1       2
names    Anuj  Mohit  Ankush
age        62     69      90
places  Delhi  Delhi   Delhi